app/views/listing/index.html.erb

        <h2>Choose the products you want to order below:</h2>
        <% cache ["listing", Product.latest] do %>
---
SELECT "products".* FROM "products" ORDER BY "products"."updated_at" DESC LIMIT 1