app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(cart_params)

    if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 22 Jul 2014 02:14:02 UTC +00:00], ["updated_at", Tue, 22 Jul 2014 02:14:02 UTC +00:00]]