app/controllers/deliveries_controller.rb

SELECT "deliveries".* FROM "deliveries"
---
  def index
    @deliveries = Delivery.all

INSERT INTO "deliveries" ("address", "created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "deliveries"], ["created_at", Mon, 04 Aug 2014 03:08:10 UTC +00:00], ["email", "wwwecwc"], ["name", "Marvin"], ["updated_at", Mon, 04 Aug 2014 03:08:10 UTC +00:00]]
---
  def create
    @delivery = Delivery.new(delivery_params)
    #@delivery.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @delivery.save

UPDATE "deliveries" SET "email" = ?, "updated_at" = ? WHERE "deliveries"."id" = 1  [["email", "marvin@gom.com"], ["updated_at", Mon, 04 Aug 2014 03:12:23 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @delivery.update(delivery_params)

DELETE FROM "deliveries" WHERE "deliveries"."id" = ?  [["id", 980190962]]
---
  def destroy
    @delivery.destroy

SELECT "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = ? LIMIT 1  [["id", "980190962"]]
---
    def set_delivery
      @delivery = Delivery.find(params[:id])