app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY "products"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 21 Jul 2014 02:04:04 UTC +00:00], ["updated_at", Mon, 21 Jul 2014 02:04:04 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Mon, 21 Jul 2014 02:04:04 UTC +00:00], ["product_id", 1], ["updated_at", Mon, 21 Jul 2014 02:04:04 UTC +00:00]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 7  [["quantity", 3], ["updated_at", Mon, 21 Jul 2014 04:45:03 UTC +00:00]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save