app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" ASC

  def create
    @order = Order.new(order_params)

    if @order.save
---
INSERT INTO "orders" ("created_at", "email", "name", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 03 Jul 2014 15:17:18 UTC +00:00], ["email", "marvin8214@yahoo.com"], ["name", "rie "], ["quantity", 11], ["updated_at", Thu, 03 Jul 2014 15:17:18 UTC +00:00]]