app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 10 Aug 2014 13:38:13 UTC +00:00], ["updated_at", Sun, 10 Aug 2014 13:38:13 UTC +00:00]]