app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "email", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "title" = ?, "description" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = 980190962  [["title", "Lorem Ipsum"], ["description", "what is that?"], ["price", #<BigDecimal:105c3c0e8,'0.1595E2',18(18)>], ["updated_at", Tue, 22 Jul 2014 02:14:02 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)